In [1]:
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import scipy.stats as st
import numpy as np
from scipy.stats import linregress

In [20]:
# Study data file
sales_data_path = "C:/Users/cghos/Desktop/group-project/project1_saledata.csv"

# Read the data 
sales_data = pd.read_csv(sales_data_path)
sales_data

,RegionID,SizeRank,RegionName,RegionType,StateName,2008-02-29,2008-03-31,2008-04-30,2008-05-31,2008-06-30,...,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31,2022-11-30
0,102001,0,United States,country,NaN,180000.0,185000.0,185000.0,187110.0,193000.0,...,330000.0,345000.0,360000.0,365000.0,365000.0,355000.0,349000.0,341307.0,335000.0,329000.0
1,394913,1,"New York, NY",msa,NY,404920.0,399000.0,399451.0,400000.0,405000.0,...,516500.0,525000.0,540000.0,546500.0,570000.0,585000.0,580000.0,560000.0,540000.0,534450.0
2,753899,2,"Los Angeles, CA",msa,CA,505000.0,495000.0,500000.0,490000.0,482000.0,...,865000.0,900000.0,935000.0,934000.0,915000.0,890000.0,878000.0,865000.0,853250.0,850000.0
3,394463,3,"Chicago, IL",msa,IL,239000.0,237500.0,240000.0,240000.0,250000.0,...,270000.0,280000.0,300000.0,306000.0,315000.0,310000.0,300000.0,285000.0,279000.0,280000.0
4,394514,4,"Dallas, TX",msa,TX,137000.0,144500.0,143500.0,145874.0,154900.0,...,368000.0,387000.0,415000.0,425000.0,424167.0,410000.0,400000.0,388000.0,385000.0,375000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
611,395004,853,"Prineville, OR",msa,OR,NaN,NaN,NaN,NaN,NaN,...,406900.0,546500.0,402000.0,495000.0,399950.0,395000.0,532450.0,410000.0,350000.0,488950.0
612,394322,861,"Altus, OK",msa,OK,NaN,NaN,NaN,NaN,NaN,...,169950.0,115000.0,195000.0,229000.0,206000.0,152800.0,164000.0,184750.0,116250.0,137500.0
613,394418,867,"Brookings, OR",msa,OR,NaN,NaN,NaN,NaN,NaN,...,465000.0,420000.0,500000.0,415000.0,475000.0,467500.0,445000.0,485000.0,445000.0,385000.0
614,395239,884,"Worthington, MN",msa,MN,NaN,NaN,NaN,NaN,NaN,...,178000.0,169500.0,206250.0,175450.0,184000.0,197000.0,170000.0,193000.0,194000.0,174113.0
615,786253,914,"Brownsville, TN",msa,TN,NaN,NaN,NaN,NaN,NaN,...,125000.0,150000.0,172500.0,135500.0,170000.0,150500.0,190000.0,182000.0,158800.0,155500.0

In [23]:
Seattle_df=sales_data[sales_data["RegionName"] == "Seattle, WA"]
Seattle_df

,RegionID,SizeRank,RegionName,RegionType,StateName,2008-02-29,2008-03-31,2008-04-30,2008-05-31,2008-06-30,...,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31,2022-11-30
15,395078,15,"Seattle, WA",msa,WA,334990.0,330000.0,337000.0,336950.0,335000.0,...,653000.0,706000.0,740000.0,750000.0,720000.0,680000.0,665000.0,660000.0,669950.0,630000.0

In [57]:
Tampa_df=sales_data[sales_data["RegionName"] == "Tampa, FL"]
Tampa_df

,RegionID,SizeRank,RegionName,RegionType,StateName,2008-02-29,2008-03-31,2008-04-30,2008-05-31,2008-06-30,...,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31,2022-11-30
18,395148,18,"Tampa, FL",msa,FL,167346.0,170750.0,168000.0,173000.0,175000.0,...,335000.0,350000.0,357550.0,375000.0,386000.0,380000.0,370000.0,360000.0,368000.0,355000.0

In [59]:
San_Jose_df = sales_data[sales_data["RegionName"] == "San Jose, CA"]
San_Jose_df

,RegionID,SizeRank,RegionName,RegionType,StateName,2008-02-29,2008-03-31,2008-04-30,2008-05-31,2008-06-30,...,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31,2022-11-30
35,395059,35,"San Jose, CA",msa,CA,692500.0,705000.0,695000.0,700000.0,680000.0,...,1400000.0,1510000.0,1550000.0,1513500.0,1465000.0,1390000.0,1350000.0,1320000.0,1325000.0,1301000.0

In [60]:
Phoenix_df = sales_data[sales_data["RegionName"] == "Phoenix, AZ"]
Phoenix_df

,RegionID,SizeRank,RegionName,RegionType,StateName,2008-02-29,2008-03-31,2008-04-30,2008-05-31,2008-06-30,...,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31,2022-11-30
10,394976,10,"Phoenix, AZ",msa,AZ,227000.0,225000.0,227000.0,226000.0,225000.0,...,452000.0,469000.0,475100.0,491000.0,490000.0,470000.0,457499.0,449450.0,449000.0,430000.0

In [61]:
Austin_df = sales_data[sales_data["RegionName"] == "Austin, TX"]
Austin_df

,RegionID,SizeRank,RegionName,RegionType,StateName,2008-02-29,2008-03-31,2008-04-30,2008-05-31,2008-06-30,...,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31,2022-11-30
29,394355,29,"Austin, TX",msa,TX,180500.0,185000.0,186000.0,189998.0,192000.0,...,505750.0,545000.0,565000.0,585250.0,560000.0,525000.0,512875.0,497500.0,483662.0,475000.0

In [63]:
combined_cities_1 = pd.concat([Seattle_df, Tampa_df,
                              San_Jose_df, Phoenix_df, 
                             Austin_df]) 
combined_cities_1

,RegionID,SizeRank,RegionName,RegionType,StateName,2008-02-29,2008-03-31,2008-04-30,2008-05-31,2008-06-30,...,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31,2022-11-30
15,395078,15,"Seattle, WA",msa,WA,334990.0,330000.0,337000.0,336950.0,335000.0,...,653000.0,706000.0,740000.0,750000.0,720000.0,680000.0,665000.0,660000.0,669950.0,630000.0
18,395148,18,"Tampa, FL",msa,FL,167346.0,170750.0,168000.0,173000.0,175000.0,...,335000.0,350000.0,357550.0,375000.0,386000.0,380000.0,370000.0,360000.0,368000.0,355000.0
35,395059,35,"San Jose, CA",msa,CA,692500.0,705000.0,695000.0,700000.0,680000.0,...,1400000.0,1510000.0,1550000.0,1513500.0,1465000.0,1390000.0,1350000.0,1320000.0,1325000.0,1301000.0
10,394976,10,"Phoenix, AZ",msa,AZ,227000.0,225000.0,227000.0,226000.0,225000.0,...,452000.0,469000.0,475100.0,491000.0,490000.0,470000.0,457499.0,449450.0,449000.0,430000.0
29,394355,29,"Austin, TX",msa,TX,180500.0,185000.0,186000.0,189998.0,192000.0,...,505750.0,545000.0,565000.0,585250.0,560000.0,525000.0,512875.0,497500.0,483662.0,475000.0

In [70]:
combined_cities_1.columns

Index(['RegionID', 'SizeRank', 'RegionName', 'RegionType', 'StateName',
       '2008-02-29', '2008-03-31', '2008-04-30', '2008-05-31', '2008-06-30',
       ...
       '2022-02-28', '2022-03-31', '2022-04-30', '2022-05-31', '2022-06-30',
       '2022-07-31', '2022-08-31', '2022-09-30', '2022-10-31', '2022-11-30'],
      dtype='object', length=183)

[Index(['RegionID', 'SizeRank', 'RegionName', 'RegionType', 'StateName',
        '2008-02-29', '2008-03-31', '2008-04-30', '2008-05-31', '2008-06-30',
        ...
        '2022-02-28', '2022-03-31', '2022-04-30', '2022-05-31', '2022-06-30',
        '2022-07-31', '2022-08-31', '2022-09-30', '2022-10-31', '2022-11-30'],
       dtype='object', length=183)]

In [120]:
combined_cities_list = []

for year in range(2015,2022):
    for month in range ()
    try:
        year_columns = ['RegionName', 'StateName', f'{year}-01-31',f'{year}-02-29', f'{year}-03-31',
                                           f'{year}-04-30', f'{year}-05-31', f'{year}-06-30',f'{year}-07-31',
                                           f'{year}-08-31', f'{year}-09-30', f'{year}-10-31', f'{year}-11-30', f'{year}-12-31']
        combined_cities_list.append(combined_cities_1[year_columns])
    except:
        year_columns = ['RegionName', 'StateName', f'{year}-01-31',f'{year}-02-28', f'{year}-03-31',
                                           f'{year}-04-30', f'{year}-05-31', f'{year}-06-30',f'{year}-07-31', f'{year}-08-31',
                                           f'{year}-09-30', f'{year}-10-31', f'{year}-11-30', f'{year}-12-31']
        combined_cities_list.append(combined_cities_1[year_columns])
    
combined_cities_list    
# combined_cities_2015 = combined_cities_list[0]

[      RegionName StateName  2015-01-31  2015-02-28  2015-03-31  2015-04-30  \
 15   Seattle, WA        WA    311860.0    311000.0    330000.0    340000.0
 18     Tampa, FL        FL    145000.0    149200.0    155000.0    158000.0
 35  San Jose, CA        CA    667500.0    713250.0    773500.0    789000.0
 10   Phoenix, AZ        AZ    199000.0    200000.0    205000.0    206000.0
 29    Austin, TX        TX    237000.0    238000.0    246000.0    259000.0

     2015-05-31  2015-06-30  2015-07-31  2015-08-31  2015-09-30  2015-10-31  \
 15    349719.0    359990.0    345000.0    350000.0    342600.0    340681.0
 18    165000.0    170000.0    172500.0    164900.0    165500.0    164900.0
 35    825000.0    838000.0    840000.0    831000.0    790000.0    795000.0
 10    215000.0    215000.0    214900.0    212000.0    215000.0    215000.0
 29    267650.0    265000.0    261000.0    255000.0    248000.0    250000.0

     2015-11-30  2015-12-31
 15    336000.0    338000.0
 18    160000.0    167000.0
 35    800000.0    790000.0
 10    212950.0    220000.0
 29    254450.0    256000.0  ,
       RegionName StateName  2016-01-31  2016-02-29  2016-03-31  2016-04-30  \
 15   Seattle, WA        WA    327000.0    329835.0    349644.0    360000.0
 18     Tampa, FL        FL    158000.0    160000.0    169000.0    170000.0
 35  San Jose, CA        CA    732500.0    777500.0    825000.0    880000.0
 10   Phoenix, AZ        AZ    215000.0    216000.0    219900.0    225000.0
 29    Austin, TX        TX    249000.0    260000.0    269900.0    280000.0

     2016-05-31  2016-06-30  2016-07-31  2016-08-31  2016-09-30  2016-10-31  \
 15    375000.0    380000.0    379900.0    379510.0    365000.0    369925.0
 18    178250.0    186000.0    181200.0    184500.0    179800.0    179000.0
 35    900000.0    856000.0    875000.0    835000.0    830000.0    850000.0
 10    229990.0    230088.0    225500.0    230000.0    232000.0    230000.0
 29    285000.0    289000.0    280000.0    275000.0    266100.0    273750.0

     2016-11-30  2016-12-31
 15    378000.0    363000.0
 18    180000.0    182000.0
 35    838000.0    800000.0
 10    230000.0    230000.0
 29    277000.0    279000.0  ,
       RegionName StateName  2017-01-31  2017-02-28  2017-03-31  2017-04-30  \
 15   Seattle, WA        WA    350000.0    360000.0    375000.0    405000.0
 18     Tampa, FL        FL    175000.0    178000.0    184000.0    186000.0
 35  San Jose, CA        CA    815000.0    845000.0    915000.0    938000.0
 10   Phoenix, AZ        AZ    229900.0    231000.0    235000.0    235000.0
 29    Austin, TX        TX    268000.0    281000.0    285000.0    295000.0

     2017-05-31  2017-06-30  2017-07-31  2017-08-31  2017-09-30  2017-10-31  \
 15    415000.0    429975.0    424000.0    418360.0    420000.0    415000.0
 18    194500.0    202000.0    200000.0    195000.0    199900.0    190000.0
 35    946750.0    970000.0    950000.0    930000.0    975000.0   1000000.0
 10    243000.0    247000.0    244000.0    245000.0    245000.0    246800.0
 29    302000.0    309000.0    297750.0    289750.0    289000.0    289000.0

     2017-11-30  2017-12-31
 15    423219.0    415000.0
 18    196000.0    199900.0
 35   1050000.0   1100000.0
 10    249000.0    249500.0
 29    290000.0    299450.0  ,
       RegionName StateName  2018-01-31  2018-02-28  2018-03-31  2018-04-30  \
 15   Seattle, WA        WA    400000.0    430000.0    450000.0    474000.0
 18     Tampa, FL        FL    189900.0    193000.0    201000.0    202000.0
 35  San Jose, CA        CA    975000.0         NaN   1235000.0   1200000.0
 10   Phoenix, AZ        AZ    250000.0    258000.0    257000.0    257500.0
 29    Austin, TX        TX    287333.0    299900.0    299900.0    319900.0

     2018-05-31  2018-06-30  2018-07-31  2018-08-31  2018-09-30  2018-10-31  \
 15    460000.0    464719.0    455000.0    442219.0    434719.0    430000.0
 18    208000.0    217900.0    215000.0    212000.0    212000.0    208000.0
 35   1211500.0   1200000.0   1120000.0   1160000.0   1095210.0   1128000.0
 10    265500.0    270000.0    269000.0    265500.0    265750.0    264900.0
 29    320000.0    324007.0    315500.0    320000.0    301500.0    307000.0

     2018-11-30  2018-12-31
 15    425719.0    425000.0
 18    211950.0    210000.0
 35   1050000.0   1000000.0
 10    266000.0    267500.0
 29    306000.0    309000.0  ,
       RegionName StateName  2019-01-31  2019-02-28  2019-03-31  2019-04-30  \
 15   Seattle, WA        WA    415000.0    440000.0    455500.0    465000.0
 18     Tampa, FL        FL    205000.0    207500.0    213000.0    215000.0
 35  San Jose, CA        CA    996500.0   1037500.0   1100000.0   1100000.0
 10   Phoenix, AZ        AZ    265000.0    267000.0    270000.0    274000.0
 29    Austin, TX        TX    295000.0    295000.0    315000.0    325000.0

     2019-05-31  2019-06-30  2019-07-31  2019-08-31  2019-09-30  2019-10-31  \
 15    485000.0    475000.0    469000.0    469000.0    460000.0    460929.0
 18    220000.0    227750.0    229900.0    228000.0    225000.0    225000.0
 35   1145000.0   1150000.0   1100000.0   1040000.0   1037000.0   1050000.0
 10    281000.0    281500.0    282000.0    284000.0    285000.0    288500.0
 29    337250.0    340000.0    325000.0    325000.0    318000.0    326700.0

     2019-11-30  2019-12-31
 15    460000.0    470000.0
 18    222500.0    229900.0
 35   1070000.0   1025000.0
 10    286525.0    290000.0
 29    319579.0    326677.0  ,
       RegionName StateName  2020-01-31  2020-02-29  2020-03-31  2020-04-30  \
 15   Seattle, WA        WA    450000.0    474999.0    495000.0    505000.0
 18     Tampa, FL        FL    221000.0    225000.0    233000.0    238900.0
 35  San Jose, CA        CA    950500.0   1106500.0   1120000.0   1150000.0
 10   Phoenix, AZ        AZ    295000.0    300000.0    306000.0    300000.0
 29    Austin, TX        TX    311750.0    330000.0    343000.0    335000.0

     2020-05-31  2020-06-30  2020-07-31  2020-08-31  2020-09-30  2020-10-31  \
 15    492250.0    525000.0    530000.0    540000.0    552000.0    545000.0
 18    237000.0    245000.0    250000.0    254500.0    259900.0    259000.0
 35   1157500.0   1150000.0   1155000.0   1170000.0   1150000.0   1200000.0
 10    300000.0    310000.0    318900.0    325000.0    329500.0    335000.0
 29    335000.0    350000.0    363750.0    360000.0    363250.0    373500.0

     2020-11-30  2020-12-31
 15    545000.0    525300.0
 18    260000.0    265000.0
 35   1170000.0   1140000.0
 10    334000.0    334000.0
 29    372019.0    382000.0  ,
       RegionName StateName  2021-01-31  2021-02-28  2021-03-31  2021-04-30  \
 15   Seattle, WA        WA    528000.0    550000.0    600000.0    620000.0
 18     Tampa, FL        FL    257500.0    260000.0    268000.0    279900.0
 35  San Jose, CA        CA   1135000.0   1180000.0   1269500.0   1310000.0
 10   Phoenix, AZ        AZ    345000.0    355000.0    365000.0    377500.0
 29    Austin, TX        TX    370000.0    394200.0    435000.0    480000.0

     2021-05-31  2021-06-30  2021-07-31  2021-08-31  2021-09-30  2021-10-31  \
 15    650000.0    650000.0    650000.0    640000.0    625000.0    635000.0
 18    285000.0    300000.0    300000.0    302600.0    305080.0    309789.0
 35   1320000.0   1350000.0   1320000.0   1320000.0   1289500.0   1335000.0
 10    395000.0    401000.0    410000.0    415000.0    420000.0    427000.0
 29    475000.0    495000.0    495000.0    477000.0    462000.0    456843.0

     2021-11-30  2021-12-31
 15    630000.0    625000.0
 18    315000.0    325000.0
 35   1350000.0   1325000.0
 10    429750.0    430000.0
 29    478250.0    476000.0  ]

In [75]:
combined_cities_2021 = combined_cities_1 [['RegionName', 'StateName', '2021-01-31','2021-02-28', '2021-03-31',
                                           '2021-04-30', '2021-05-31', '2021-06-30','2021-07-31', '2021-08-31', 
                                           '2021-09-30', '2021-10-31', '2021-11-30', '2021-12-31']]
combined_cities_2021

,RegionName,StateName,2021-01-31,2021-02-28,2021-03-31,2021-04-30,2021-05-31,2021-06-30,2021-07-31,2021-08-31,2021-09-30,2021-10-31,2021-11-30,2021-12-31
15,"Seattle, WA",WA,528000.0,550000.0,600000.0,620000.0,650000.0,650000.0,650000.0,640000.0,625000.0,635000.0,630000.0,625000.0
18,"Tampa, FL",FL,257500.0,260000.0,268000.0,279900.0,285000.0,300000.0,300000.0,302600.0,305080.0,309789.0,315000.0,325000.0
35,"San Jose, CA",CA,1135000.0,1180000.0,1269500.0,1310000.0,1320000.0,1350000.0,1320000.0,1320000.0,1289500.0,1335000.0,1350000.0,1325000.0
10,"Phoenix, AZ",AZ,345000.0,355000.0,365000.0,377500.0,395000.0,401000.0,410000.0,415000.0,420000.0,427000.0,429750.0,430000.0
29,"Austin, TX",TX,370000.0,394200.0,435000.0,480000.0,475000.0,495000.0,495000.0,477000.0,462000.0,456843.0,478250.0,476000.0

In [74]:
combined_cities_2022 = combined_cities_1 [['RegionName', 'StateName', '2022-01-31','2022-02-28', '2022-03-31', '2022-04-30', '2022-05-31', '2022-06-30',
       '2022-07-31', '2022-08-31', '2022-09-30', '2022-10-31', '2022-11-30' ]]
combined_cities_2022

,RegionName,StateName,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31,2022-11-30
15,"Seattle, WA",WA,600000.0,653000.0,706000.0,740000.0,750000.0,720000.0,680000.0,665000.0,660000.0,669950.0,630000.0
18,"Tampa, FL",FL,325000.0,335000.0,350000.0,357550.0,375000.0,386000.0,380000.0,370000.0,360000.0,368000.0,355000.0
35,"San Jose, CA",CA,1250000.0,1400000.0,1510000.0,1550000.0,1513500.0,1465000.0,1390000.0,1350000.0,1320000.0,1325000.0,1301000.0
10,"Phoenix, AZ",AZ,440000.0,452000.0,469000.0,475100.0,491000.0,490000.0,470000.0,457499.0,449450.0,449000.0,430000.0
29,"Austin, TX",TX,480000.0,505750.0,545000.0,565000.0,585250.0,560000.0,525000.0,512875.0,497500.0,483662.0,475000.0